note/2020/contributing-to-emacs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-27 Mon 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contributing to Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Contributing to Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org29db81f">Report Emacs bug</a></li>
<li><a href="#org3d49740">The mailing list</a>
<ul>
<li><a href="#orgb734b28">Subscribe to Emacs-devel mailing list</a></li>
<li><a href="#org1574d28">Tips</a></li>
<li><a href="#org3a51aef">No one replies?</a></li>
</ul>
</li>
<li><a href="#orgd433a32">Get Emacs’ source</a></li>
<li><a href="#orgc9cb0cd">I have some code, what now?</a>
<ul>
<li><a href="#orga9bf4eb">The copyright assignment</a></li>
<li><a href="#org92f64d7">Conventions in code</a></li>
<li><a href="#orgeef0744">Conventions in commit messages</a></li>
</ul>
</li>
<li><a href="#org45e3470">file: Change.</a></li>
<li><a href="#org9aeb586">file (variable1): Change.</a></li>
<li><a href="#org314d0c9">file (function1, function2, variable3): Same change.</a></li>
<li><a href="#org50b6c5c">file (variable1): Change 1.</a>
<ul>
<li><a href="#orged6a857">Create patch and send it</a></li>
</ul>
</li>
<li><a href="#org76e6e9b">NEWS and manual</a></li>
<li><a href="#org73633fe">Debbugs</a></li>
<li><a href="#org9a84f44">GNU ELPA</a></li>
</ul>
</div>
</div>
<p>
Emacs, <i>the</i> editor we all use and love, has been running for decades, receiving contribution from hundreds of hackers along the way. But because it predates “modern” open source workflows (a.k.a GitHub and friends) by many years, you can’t do the usual thing—open issues, fork and make PR’s, etc. However, while admittedly not as convenient as GitHub, Emacs’s development workflow isn’t as tedious and difficult as many people imagines (in particular, you don’t need Gnus or deal with email in Emacs, or setup anything fancy). In this post I show what I’ve learned as a Emacs new comer about participating the development of Emacs. I hope that by sharing people what does contributing to Emacs look like, more people knows what to expect and feels comfortable to join the development of Emacs.
</p>

<div id="outline-container-org29db81f" class="outline-2">
<h2 id="org29db81f">Report Emacs bug</h2>
<div class="outline-text-2" id="text-org29db81f">
<p>
I won’t go into details here, because I think most people nowadays are well educated by numerous open source projects on how to properly report a bug. In the case of Emacs, in addition, you want to reproduce the bug with vanilla Emacs, i.e., without your configurations. You can start one with <code>emacs -Q</code>. And in Emacs type <code>M-x report-emacs-bug RET</code>, then <code>C-x M-i</code> to use your mail application to send the bug report through email (Emacs instructs you of all this). Then just wait for a developer to reply your email (see? No setup needed). The only thing to remember is to make sure you use “reply all” when replying emails (more on that in <a href="#org3d49740">The mailing list</a>.)
</p>
</div>
</div>

<div id="outline-container-org3d49740" class="outline-2">
<h2 id="org3d49740">The mailing list</h2>
<div class="outline-text-2" id="text-org3d49740">
<p>
GitHub has issues, we have a mailing list. A mailing list has subscribers. When some one sends a mail to (or cc) the mailing list address, the mailing list server forwards that message to every subscribers, so every body sees your mail. To start a new thread, send a mail to the mailing list server; to reply to someone’s message, simply “reply all”. <b>Make sure you use “reply all” when replying to messages.</b> If the message isn’t CC’ed to the mailing list server (emacs-devel@gnu.org), other people on the list can’t see it.
</p>
</div>

<div id="outline-container-orgb734b28" class="outline-3">
<h3 id="orgb734b28">Subscribe to Emacs-devel mailing list</h3>
<div class="outline-text-3" id="text-orgb734b28">
<p>
Go to <a href="https://lists.gnu.org/mailman/listinfo/emacs-devel">Emacs-devel Info Page</a>, and fill in the form to subscribe. Make sure you select “No” for “Would you like to receive list mail batched in a daily digest?”. If you select “Yes”, instead of receiving messages, you receive a “daily digest” everyday, which is more or less useless becase 1) you don’t see the full conversation, 2) you can’t participate the discussion.
</p>
</div>
</div>


<div id="outline-container-org1574d28" class="outline-3">
<h3 id="org1574d28">Tips</h3>
<div class="outline-text-3" id="text-org1574d28">
<p>
Emacs-devel is busy, there are a couple dozen messages everyday, if you don’t want your inbox flooded, you better setup a separate mail folder for them. As an example, this is what I do on Gmail: I go to “Settings”, “Filters and Blocked Addresses”, “Create a new filter”, filter any mail that has the words “emacs-devel@gnu.org”, and asks Gmail to skip the inbox and apply “emacs-devel” label. The effect is that all emacs-devel messages don’t appear in your inbox and instead show up in emacs-devel folder.
</p>
</div>
</div>

<div id="outline-container-org3a51aef" class="outline-3">
<h3 id="org3a51aef">No one replies?</h3>
<div class="outline-text-3" id="text-org3a51aef">
<p>
In general, give it a week or so before pinging your message. Normally when no one reply to a new message, it is because people have seen it don’t know enough to say anything intelligent about the topic. On the other hand, don’t send a bug report without a patch to emacs-devel, report it as a bug (even if you are not sure if it should be classified as a bug, report it as a bug).
</p>
</div>
</div>
</div>

<div id="outline-container-orgd433a32" class="outline-2">
<h2 id="orgd433a32">Get Emacs’ source</h2>
<div class="outline-text-2" id="text-orgd433a32">
<ul class="org-ul">
<li>This is Emacs’ savannah homepage: <a href="https://savannah.gnu.org/projects/emacs/">https://savannah.gnu.org/projects/emacs/</a></li>
<li>This is Emacs’ git source page: <a href="http://git.savannah.gnu.org/cgit/emacs.git">http://git.savannah.gnu.org/cgit/emacs.git</a></li>
</ul>

<p>
The home page tells you how to clone Emacs’ source:
</p>
<div class="org-src-container">
<pre class="src src-shell">git clone -b master git://git.sv.gnu.org/emacs.git
</pre>
</div>

<p>
Once you have the source, you can find most of the information mentioned in this post in <code>/CONTRIBUTE</code>. For example, the first section clearly demonstrates how to compile Emacs:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">More info is in INSTALL.</span>
./autogen.sh
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">You can use ./configure.sh --help to see the avaliable options.</span>
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">This is the step where you enable/disable optional functionalities</span>
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">like dynamic module, portable dumper, svg, etc.</span>
./configure.sh
make
</pre>
</div>

<p>
And the executable is <code>/src/emacs</code>, welcome to the future (release)! 
</p>
</div>
</div>

<div id="outline-container-orgc9cb0cd" class="outline-2">
<h2 id="orgc9cb0cd">I have some code, what now?</h2>
<div class="outline-text-2" id="text-orgc9cb0cd">
</div>
<div id="outline-container-orga9bf4eb" class="outline-3">
<h3 id="orga9bf4eb">The copyright assignment</h3>
<div class="outline-text-3" id="text-orga9bf4eb">
<p>
Every non-trivial contribution to GNU Emacs needs to have a copyright assignment signed. Basically by signing the assignment, you give the copyright of your code to FSF. See more at <a href="https://www.gnu.org/licenses/why-assign.en.html">Why Copyright Assignment</a>. You need to first check with your employer before signing it. Most of the time it’s no problem. To sign the assignment, ask for a form on the mailing list, and someone will send you the form. You fill it in and send to the instructed “FSF clerk”, then he sends you the document to sign, either by email or by mail. You sign it and send it back, and he sends you the final document with FSF signature. 
</p>
</div>
</div>

<div id="outline-container-org92f64d7" class="outline-3">
<h3 id="org92f64d7">Conventions in code</h3>
<div class="outline-text-3" id="text-org92f64d7">
<ul class="org-ul">
<li>Write regular sentences in comment, i.e., with capitalization and period. Format comments with <code>M-q</code> (<code>fill-paragraph</code>).</li>
<li>Comments should be in American English and with two spaces after every sentence.</li>
<li>Don’t write over 80–90 columns (I don’t really know if there is a hard limit, but in general try to keep in with the rest of the code).</li>
</ul>
</div>
</div>

<div id="outline-container-orgeef0744" class="outline-3">
<h3 id="orgeef0744">Conventions in commit messages</h3>
<div class="outline-text-3" id="text-orgeef0744">
<p>
The general format: #+begin<sub>example</sub>
Summary line (no ending period)
</p>

<p>
Some more info (optional).
</p>
</div>
</div>
</div>

<div id="outline-container-org45e3470" class="outline-2">
<h2 id="org45e3470">file: Change.</h2>
</div>
<div id="outline-container-org9aeb586" class="outline-2">
<h2 id="org9aeb586">file (variable1): Change.</h2>
</div>
<div id="outline-container-org314d0c9" class="outline-2">
<h2 id="org314d0c9">file (function1, function2, variable3): Same change.</h2>
</div>
<div id="outline-container-org50b6c5c" class="outline-2">
<h2 id="org50b6c5c">file (variable1): Change 1.</h2>
<div class="outline-text-2" id="text-org50b6c5c">
<p>
(function2): Change 2. (function1, macro2): Same change. #+end<sub>example</sub>
</p>

<ul class="org-ul">
<li>The file path is relative to the source root, e.g., <code>/lisp/progmodes/gdb-mi.el</code>.</li>
<li>In <code>Change</code>, document <i>what</i> changed, not <i>why</i> the change is made. <i>“Why”</i> is better put in the comments.</li>
<li>For new function/variable/macro, It suffice to say “New function/variable/macro”.</li>
<li>Don’t exceed 78 characters each line.</li>
<li>Try to use only ASCII characters (so people on limited terminals can view these messages). For example, prefer straight quotes over curly quotes.</li>
<li>Sames as comments—American English and two spaces after every sentence.</li>
</ul>
</div>

<div id="outline-container-orged6a857" class="outline-3">
<h3 id="orged6a857">Create patch and send it</h3>
<div class="outline-text-3" id="text-orged6a857">
<p>
Create a single patch for each individual changes. Don’t send a patch with three new features combined, that is harder to review; on the other hand, don’t send a series of patches for a single feature, squash<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> them into one patch. Also, send your patch early and small and update along the way, that also helps other people to review it. To save you from googling, here’s some ways to create a patch:
</p>

<ol class="org-ol">
<li>Use magit. To generate a quick diff patch, open a diff buffer by either <code>d d</code> on a change or commit; in the diff buffer, hit <code>W s</code>. To generate a patch from a commit or a range of commits, go on to a commit and do <code>W c c</code>. This puts the patch file(s) under the project root and isn’t very convenient, I usually just do <code>! ! git format-patch -&lt;# of commits&gt; --stdout &gt; &lt;file&gt;.</code></li>
<li>From command line, <code>git format-patch -&lt;# of commits, e.g., 1&gt; --stdout &gt; &lt;file&gt;</code></li>
</ol>

<p>
To send your patch, write an email to the mailing list: <a href="mailto:emacs-devel@gnu.org">emacs-devel</a>. Drag your patch to the very end of the message, after signatures. Normally this is all it needs. Sometimes the message could be garbled; in that case, changing the message to plain text usually helps. You can also send a patch to debbugs, the bug tracker, if the patch is a bug fix. See <a href="#org73633fe">Debbugs</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org76e6e9b" class="outline-2">
<h2 id="org76e6e9b">NEWS and manual</h2>
<div class="outline-text-2" id="text-org76e6e9b">
<p>
If you made a user-visible change, you should document this change in the NEWS file, possibly also update the manual. <b>You don’t need to worry about these until your patch is finalized, though. So maybe skip this section for now.</b> And Emacs maintainers will let you know what to do. Below is the relevant section in <code>/CONTRIBUTE</code>:
</p>

<blockquote>
<p>
Any change that matters to end-users should have an entry in etc/NEWS. Try to start each NEWS entry with a sentence that summarizes the entry and takes just one line &#x2013; this will allow to read NEWS in Outline mode after hiding the body of each entry.
</p>

<p>
Doc-strings should be updated together with the code.
</p>

<p>
New defcustom's should always have a ':version' tag stating the first Emacs version in which they will appear.  Likewise with defcustom's whose value is changed &#x2013; update their ':version' tag.
</p>

<p>
Think about whether your change requires updating the manuals.  If you know it does not, mark the NEWS entry with "&#x2014;".  If you know that <b>all</b> the necessary documentation updates have been made as part of your changes or those by others, mark the entry with "<del>+</del>". Otherwise do not mark it.
</p>

<p>
If your change requires updating the manuals to document new functions/commands/variables/faces, then use the proper Texinfo command to index them; for instance, use @vindex for variables and @findex for functions/commands.  For the full list of predefined indices, see
<a href="https://www.gnu.org/software/texinfo/manual/texinfo/html_node/Predefined-Indices.html">https://www.gnu.org/software/texinfo/manual/texinfo/html_node/Predefined-Indices.html</a>
or run the shell command 'info "(texinfo)Predefined Indices"'.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org73633fe" class="outline-2">
<h2 id="org73633fe">Debbugs</h2>
<div class="outline-text-2" id="text-org73633fe">
<p>
<a href="https://debbugs.gnu.org">Debbugs</a> is the bug tracker for GNU operating system. Here is <a href="https://debbugs.gnu.org/Emacs.html">Emacs’ debbugs home page</a>. I’ve covered how to report a bug. After you sent the email reporting the bug, debbugs will reply to you a confirmation email with a bug number. Instead of replying to messages in the bug report, you can also comment by sending a message to bug-number@gnu.debbugs.org. When the bug is fixed, you can send a message to &lt;bug-number&gt;-done@debbugs.gnu.org, e.g., 40000-done@debbugs.gnu.org. That closes the bug.
</p>

<p>
If you want to view currently open bugs, you can either <a href="https://debbugs.gnu.org/cgi/pkgreport.cgi?package=emacs;max-bugs=100;base-order=1;bug-rev=1">browse online</a>, or view them in Emacs: install the package <code>debbugs</code> and <code>M-x debbugs-gnu</code>. You can click on bugs to view them, and view the conversation. You can even reply by <code>S w</code> on a message, and write your message in Emacs, and hit <code>C-c C-c</code> to send. Chose “mail client” and Emacs invokes your default mail client to send this mail. Hit <code>C-c C-k</code> to cancel the message.
</p>
</div>
</div>

<div id="outline-container-org9a84f44" class="outline-2">
<h2 id="org9a84f44">GNU ELPA</h2>
<div class="outline-text-2" id="text-org9a84f44">
<p>
Have a good package? Add it to GNU ELPA! Pros:
</p>
<ul class="org-ul">
<li>Get reviews from people that knows Emacs and Emacs Lisp best.</li>
<li>Instantly avaliable from vanilla Emacs.</li>
<li>You <i>can</i> host your package on other places, such as GitHub.</li>
<li>You <i>can</i> push to your package without review, and don’t need to follow Emacs conventions for commit messages.</li>
</ul>
<p>
Cons:
</p>
<ul class="org-ul">
<li>You need to sign the copyright assignment. And make sure all the contributors of your package (with significant contribution, i.e., ~15 lines) signs it.</li>
</ul>

<p>
View <a href="http://git.savannah.gnu.org/cgit/emacs/elpa.git/plain/README">README</a> for more detailed info.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Squash means combining several commits into one. It is easy to do with Magit: <code>l l</code> go to the log buffer; then go to the earliest commit you want to change, hit <code>r i</code>; hit <code>s</code> on the commits you wan to squash, commits marked with “s” will squash up. You can also use <code>M-n/p</code> to move the order of commits; then hit <code>C-c C-c</code> to edit the new commit message, and <code>C-c C-c</code> again to confirm.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2020-04-25 Sat 16:59</p>
<p class-"last-modified">Last modified on 2020-04-27 Mon 16:21</p>
</div>
</body>
</html>
